/*
global migration "/Users/chandlerwong/Desktop/Pollution_project"
	global data "$migration/data"
	global output "$migration/output"	
		global raw "$data/raw"
		global interm "$data/intermediate"
		global processed "$data/processed"

cd $interm

*/

* -----------
* input missing year
clear
input str116 subfirm str6 code year stock
"内蒙古屯河河套番茄制品有限责任公司" "600737" 2015 3600
"内蒙古屯河河套番茄制品有限责任公司" "600737" 2016 3600

"新疆中基蕃茄制品有限责任公司" "000972" 2012 47280
"新疆中基蕃茄制品有限责任公司" "000972" 2011 47280
"新疆中基蕃茄制品有限责任公司" "000972" 2010 47280
"新疆中基蕃茄制品有限责任公司" "000972" 2015 0


"华新南通水泥有限公司" "600801" 2011 8968.02
"华新南通水泥有限公司" "600801" 2012 8968.02
"华新南通水泥有限公司" "600801" 2013 8968.02
"华新南通水泥有限公司" "600801" 2014 8968.02
"华新南通水泥有限公司" "600801" 2015 8968.02
"华新南通水泥有限公司" "600801" 2016 8968.02
"华新南通水泥有限公司" "600801" 2017 8968.02


"苏州恒升新材料有限公司" "300072" 2013 12175
"苏州恒升新材料有限公司" "300072" 2014 12175
"苏州恒升新材料有限公司" "300072" 2015 12175

"上海广丰化工有限公司" "002010" 2011 0

"浙江凯丰特种纸业有限公司" "002012" 2012 1740
"浙江凯丰特种纸业有限公司" "002012" 2011 1740
"浙江凯丰特种纸业有限公司" "002012" 2010 1740

"镇江润港化工有限公司" "002453" 2014 1875
"镇江润港化工有限公司" "002453" 2013 0

"江西大唐国际抚州发电有限责任公司" "601991" 48400 2012
"江西大唐国际抚州发电有限责任公司" "601991" 68400 2013
"江西大唐国际抚州发电有限责任公司" "601991" 68400 2014

"天津鞍钢天铁冷轧薄板有限公司" "000898" 18500 2013
"天津鞍钢天铁冷轧薄板有限公司" "000898" 0 2014

"鄂州海大饲料有限公司" "002311" 2010 66.02

* 000027
"东莞深能源樟洋电力有限公司" "000027" 2011 11587.24

* 000422
"湖北宜化肥业有限公司" "000422" 2010 10000
"湖北宜化肥业有限公司" "000422" 2011 27231.78
"湖北宜化肥业有限公司" "000422" 2012 27231.78
"湖北宜化肥业有限公司" "000422" 2013 27231.78
"湖北宜化肥业有限公司" "000422" 2014 27231.78
"湖北宜化肥业有限公司" "000422" 2015 27231.78
"湖北宜化肥业有限公司" "000422" 2016 27231.78
"湖北宜化肥业有限公司" "000422" 2016 27231.78
"湖北宜化肥业有限公司" "000422" 2017 28533.73

* 000525
"响水苏农农资连锁有限公司"   "000525" 2013 50
"响水苏农农资连锁有限公司"   "000525" 2016 50
"响水苏农农资连锁有限公司"   "000525" 2017 50
"姜堰苏农农资连锁有限公司"   "000525" 2013 50
"姜堰苏农农资连锁有限公司"   "000525" 2016 50
"姜堰苏农农资连锁有限公司"   "000525" 2017 50
"淮安苏农农资连锁有限责任公司" "000525" 2013 35
"淮安苏农农资连锁有限责任公司" "000525" 2016 35
"淮安苏农农资连锁有限责任公司" "000525" 2017 35
"陕西红太阳农资连锁有限公司"   "000525" 2013 88
"陕西红太阳农资连锁有限公司"   "000525" 2016 88
"陕西红太阳农资连锁有限公司"   "000525" 2017 88
"盐城苏农农资连锁有限公司"   "000525" 2010 75.9

* 002010
"上海广丰化工有限公司" "002010" 2011 0

/* 002100
"河南宏展实业有限公司" "002100" 2010 18897
"河南宏展实业有限公司" "002100" 2011 18897
"河南宏展实业有限公司" "002100" 2012 18897
"河南宏展实业有限公司" "002100" 2013 18897
"河南宏展实业有限公司" "002100" 2014 18897
"河南宏展实业有限公司" "002100" 2015 18897
"河南宏展实业有限公司" "002100" 2016 18897
"河南宏展实业有限公司" "002100" 2017 18897
*/



""

end

gen code_str = code 


*** EOF